RIET/src/Documents/InventoryКорректировка/InventoryКорректировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InventoryКорректировка</name>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <registerRecords>AccumulationRegister.MaterialsAndSupplies</registerRecords>
  <registerRecords>AccumulationRegister.InventoryTangibleAssetsCosts</registerRecords>
  <registerRecords>AccumulationRegister.InventoryBatches</registerRecords>
  <registerRecords>AccumulationRegister.МатериальныеАктивы</registerRecords>
  <attributes>
    <name>InventoryLocation</name>
    <type>
      <types>CatalogRef.InventoryLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>PoNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PO</name>
    <type>
      <types>CatalogRef.ЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>IctDocType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HasFinishedGoods</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastModified</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>OriginalDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransactionType</name>
    <type>
      <types>EnumRef.InventoryTransactionsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>InventoryСписание</name>
    <type>
      <types>DocumentRef.InventoryСписание</types>
      <types>DocumentRef.InventoryКорректировка</types>
    </type>
  </attributes>
  <attributes>
    <name>OrdNum</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Good</name>
      <type>
        <types>CatalogRef.InventoryGoods</types>
      </type>
    </attributes>
    <attributes>
      <name>UOM</name>
      <type>
        <types>CatalogRef.UOMs</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FiscalPrice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FiscalSum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FinishedGood</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ManagementPrice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ManagementSum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>DocumentRef.InventoryПоступление</types>
        <types>DocumentRef.InventoryКорректировка</types>
        <types>DocumentRef.InventoryПеремещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Reference</name>
      <type>
        <types>CatalogRef.КомментарииКорректировок</types>
      </type>
    </attributes>
    <attributes>
      <name>DSS</name>
      <type>
        <types>DocumentRef.ПроводкаDSS</types>
      </type>
    </attributes>
    <attributes>
      <name>PoNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/InventoryСписание/InventoryСписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InventoryСписание</name>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <registerRecords>InformationRegister.РасчетСебестоимости</registerRecords>
  <registerRecords>AccumulationRegister.InventoryBatches</registerRecords>
  <attributes>
    <name>InventoryLocation</name>
    <type>
      <types>CatalogRef.InventoryLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>IctDocType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>HasFinishedGoods</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastModified</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OriginalDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransactionType</name>
    <type>
      <types>EnumRef.InventoryTransactionsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>SO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьПолучателяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьОтправителяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПродажи</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериалПолучил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериалПередал</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>LocationIn</name>
    <type>
      <types>CatalogRef.InventoryLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Defer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Good</name>
      <type>
        <types>CatalogRef.InventoryGoods</types>
      </type>
    </attributes>
    <attributes>
      <name>UOM</name>
      <type>
        <types>CatalogRef.UOMs</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FinishedGood</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>FinishedGoodPONumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ManagementPrice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ManagementSum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>DocumentRef.InventoryПоступление</types>
        <types>DocumentRef.InventoryКорректировка</types>
        <types>DocumentRef.InventoryПеремещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ОСLawson</name>
      <type>
        <types>CatalogRef.ОсновныеСредстваLawson</types>
      </type>
    </attributes>
    <attributes>
      <name>TicketId</name>
      <type>
        <types>DocumentRef.SiebelOrders</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/InventoryКорректировка/Forms/ФормаВыбораДокументовСписания/Module.bsl
&НаСервере
Процедура ЗаполнитьФорму();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Параметры.ДокументКорректировки);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	InventoryКорректировкаGoods.Good.Код
	|ПОМЕСТИТЬ КодыДокументаКорректировки
	|ИЗ
	|	Документ.InventoryКорректировка.Goods КАК InventoryКорректировкаGoods
	|ГДЕ
	|	InventoryКорректировкаGoods.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	InventoryСписаниеGoods.Ссылка,
	|	InventoryСписаниеGoods.Good.Код
	|ПОМЕСТИТЬ КодыДокументаСписанияВсе
	|ИЗ
	|	Документ.InventoryСписание.Goods КАК InventoryСписаниеGoods
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КодыДокументаКорректировки.GoodКод) КАК КоличествоКодов
	|ПОМЕСТИТЬ КоличествоКодовДокументаКорректировки
	|ИЗ
	|	КодыДокументаКорректировки КАК КодыДокументаКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыДокументаСписанияВсе.Ссылка,
	|	ВЫБОР
	|		КОГДА КодыДокументаСписанияВсе.GoodКод В
	|				(ВЫБРАТЬ
	|					КодыДокументаКорректировки.GoodКод
	|				ИЗ
	|					КодыДокументаКорректировки КАК КодыДокументаКорректировки)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НаличиеНужногоКода
	|ПОМЕСТИТЬ КодыДокументаСписания
	|ИЗ
	|	КодыДокументаСписанияВсе КАК КодыДокументаСписанияВсе,
	|	КодыДокументаКорректировки КАК КодыДокументаКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыДокументаСписания.Ссылка,
	|	СУММА(КодыДокументаСписания.НаличиеНужногоКода) КАК КоличествоКодовВДокументеСписания
	|ПОМЕСТИТЬ КоличествоКодовДокументаСписания
	|ИЗ
	|	КодыДокументаСписания КАК КодыДокументаСписания
	|
	|СГРУППИРОВАТЬ ПО
	|	КодыДокументаСписания.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоличествоКодовДокументаСписания.Ссылка
	|ПОМЕСТИТЬ НужныеСсылкиДокументовСписания
	|ИЗ
	|	КоличествоКодовДокументаСписания КАК КоличествоКодовДокументаСписания,
	|	КоличествоКодовДокументаКорректировки КАК КоличествоКодовДокументаКорректировки
	|ГДЕ
	|	КоличествоКодовДокументаСписания.КоличествоКодовВДокументеСписания = КоличествоКодовДокументаКорректировки.КоличествоКодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	InventoryСписаниеGoods.Ссылка Ссылка1,
	|	СУММА(InventoryСписаниеGoods.ManagementSum) КАК ManagementSum
	|ИЗ
	|	Документ.InventoryСписание.Goods КАК InventoryСписаниеGoods,
	|	НужныеСсылкиДокументовСписания КАК НужныеСсылкиДокументовСписания
	|ГДЕ
	|	InventoryСписаниеGoods.Ссылка В
	|			(ВЫБРАТЬ
	|				НужныеСсылкиДокументовСписания.Ссылка
	|			ИЗ
	|				НужныеСсылкиДокументовСписания КАК НужныеСсылкиДокументовСписания)
	|
	|СГРУППИРОВАТЬ ПО
	|	InventoryСписаниеGoods.Ссылка";
	
	ТЗ.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры

&НаКлиенте
Процедура ТЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	стр = Элементы.ТЗ.ТекущиеДанные;
	Закрыть(стр.Ссылка1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьФорму();
КонецПроцедуры
